{
  "2025-12-27": {
    "1946": {
      "score": 88,
      "advice": "Focus on practical matters and financial prudence; your diligence will pay off.",
      "lucky_number": 3
    },
    "1958": {
      "score": 82,
      "advice": "Nurture your relationships with clear communication; avoid misunderstandings.",
      "lucky_number": 9
    },
    "1970": {
      "score": 75,
      "advice": "Seek balance between your career ambitions and personal well-being to avoid burnout.",
      "lucky_number": 5
    },
    "1982": {
      "score": 90,
      "advice": "Embrace new opportunities with confidence; your adaptability is your greatest asset.",
      "lucky_number": 1
    },
    "1994": {
      "score": 85,
      "advice": "Invest time in skill development; continuous learning will open unexpected doors.",
      "lucky_number": 6
    },
    "2006": {
      "score": 78,
      "advice": "Prioritize your studies and extracurriculars; focus on building a strong foundation for the future.",
      "lucky_number": 2
    }
  },
  "2025-12-28": {
    "1946": {
      "score": 70,
      "advice": "Focus on maintaining calm and steady progress in all endeavors.",
      "lucky_number": 3
    },
    "1958": {
      "score": 80,
      "advice": "Embrace new opportunities with a balanced perspective and strategic planning.",
      "lucky_number": 9
    },
    "1970": {
      "score": 75,
      "advice": "Prioritize clear communication to avoid misunderstandings with loved ones and colleagues.",
      "lucky_number": 5
    },
    "1982": {
      "score": 90,
      "advice": "Trust your intuition and take bold steps towards your long-term goals.",
      "lucky_number": 1
    },
    "1994": {
      "score": 85,
      "advice": "Seek knowledge and adapt your skills to navigate upcoming challenges effectively.",
      "lucky_number": 6
    },
    "2006": {
      "score": 78,
      "advice": "Nurture your relationships and find joy in simple, consistent efforts.",
      "lucky_number": 4
    }
  },
  "2025-12-29": {
    "1946": {
      "score": 80,
      "advice": "Focus on strengthening your relationships and nurturing your inner peace.",
      "lucky_number": 3
    },
    "1958": {
      "score": 75,
      "advice": "Embrace new opportunities with caution and rely on your wisdom.",
      "lucky_number": 9
    },
    "1970": {
      "score": 70,
      "advice": "Prioritize financial prudence and avoid unnecessary risks.",
      "lucky_number": 5
    },
    "1982": {
      "score": 85,
      "advice": "Your career path looks promising; continue to work diligently and network effectively.",
      "lucky_number": 1
    },
    "1994": {
      "score": 90,
      "advice": "This year brings excellent opportunities for personal growth and romantic connections.",
      "lucky_number": 6
    },
    "2006": {
      "score": 88,
      "advice": "Maintain a balanced approach to your studies and social life for optimal success.",
      "lucky_number": 2
    }
  },
  "2025-12-30": {
    "1946": {
      "score": 78,
      "advice": "Focus on health and well-being; delegate tasks where possible to reduce stress.",
      "lucky_number": 3
    },
    "1958": {
      "score": 82,
      "advice": "Invest time in strengthening family bonds; financial prudence will yield good returns.",
      "lucky_number": 5
    },
    "1970": {
      "score": 75,
      "advice": "Be open to new opportunities at work, but avoid impulsive decisions in your personal life.",
      "lucky_number": 9
    },
    "1982": {
      "score": 88,
      "advice": "Nurture your creative side and maintain a balanced approach to career and relationships.",
      "lucky_number": 1
    },
    "1994": {
      "score": 80,
      "advice": "Embrace learning new skills to advance your career, and prioritize mindful self-care.",
      "lucky_number": 4
    },
    "2006": {
      "score": 77,
      "advice": "Stay focused on your studies and social interactions; seek guidance from mentors.",
      "lucky_number": 6
    }
  },
  "2025-12-31": {
    "1946": {
      "score": 78,
      "advice": "Focus on fostering strong relationships with loved ones this year, as they will be your greatest support.",
      "lucky_number": 5
    },
    "1958": {
      "score": 82,
      "advice": "Embrace new opportunities in your career, but ensure you do thorough research before making any significant decisions.",
      "lucky_number": 3
    },
    "1970": {
      "score": 75,
      "advice": "Prioritize your health by adopting a balanced lifestyle and managing stress effectively.",
      "lucky_number": 9
    },
    "1982": {
      "score": 88,
      "advice": "Financial prudence is key; save diligently and avoid unnecessary expenditures.",
      "lucky_number": 6
    },
    "1994": {
      "score": 80,
      "advice": "Invest time in personal development and learning new skills to enhance your future prospects.",
      "lucky_number": 4
    },
    "2006": {
      "score": 76,
      "advice": "Maintain open communication with your family and friends to resolve any misunderstandings that may arise.",
      "lucky_number": 2
    }
  }
}