{
  "2025-12-27": {
    "1940": {
      "score": 78,
      "advice": "Focus on stable financial planning this year, as unexpected expenses may arise.",
      "lucky_number": 3
    },
    "1952": {
      "score": 88,
      "advice": "Nurture your relationships with loved ones; open communication will bring harmony.",
      "lucky_number": 9
    },
    "1964": {
      "score": 82,
      "advice": "Embrace new learning opportunities, whether professional or personal, for growth.",
      "lucky_number": 5
    },
    "1976": {
      "score": 75,
      "advice": "Be mindful of your health; prioritize rest and a balanced lifestyle.",
      "lucky_number": 1
    },
    "1988": {
      "score": 92,
      "advice": "Your career prospects are bright; take calculated risks to advance your goals.",
      "lucky_number": 8
    },
    "2000": {
      "score": 85,
      "advice": "Explore your creative side and allow yourself to express your unique talents.",
      "lucky_number": 4
    }
  },
  "2025-12-28": {
    "1940": {
      "score": 70,
      "advice": "Focus on maintaining your current steady pace to avoid unnecessary stress.",
      "lucky_number": 3
    },
    "1952": {
      "score": 80,
      "advice": "Embrace new social connections; they may bring unexpected opportunities.",
      "lucky_number": 5
    },
    "1964": {
      "score": 75,
      "advice": "Pay attention to details in financial matters to prevent minor issues.",
      "lucky_number": 8
    },
    "1976": {
      "score": 90,
      "advice": "Your innovative ideas will be well-received, so pursue them with confidence.",
      "lucky_number": 1
    },
    "1988": {
      "score": 85,
      "advice": "Seek balance between your personal and professional life to ensure overall well-being.",
      "lucky_number": 4
    },
    "2000": {
      "score": 78,
      "advice": "Channel your energy into learning a new skill that will benefit you long-term.",
      "lucky_number": 6
    }
  },
  "2025-12-29": {
    "1940": {
      "score": 75,
      "advice": "Focus on communication and understanding to navigate potential misunderstandings.",
      "lucky_number": 3
    },
    "1952": {
      "score": 80,
      "advice": "Embrace new opportunities for learning and personal growth that come your way.",
      "lucky_number": 5
    },
    "1964": {
      "score": 70,
      "advice": "Prioritize your health and well-being by maintaining a balanced lifestyle.",
      "lucky_number": 9
    },
    "1976": {
      "score": 85,
      "advice": "Your financial endeavors are likely to be fruitful, so invest wisely and cautiously.",
      "lucky_number": 1
    },
    "1988": {
      "score": 90,
      "advice": "This is a time for significant achievements in your career; be bold and assertive.",
      "lucky_number": 2
    },
    "2000": {
      "score": 78,
      "advice": "Nurture your relationships and invest time in those who matter most.",
      "lucky_number": 6
    }
  },
  "2025-12-30": {
    "1940": {
      "score": 75,
      "advice": "Focus on conserving energy and enjoying quieter pursuits this year.",
      "lucky_number": 5
    },
    "1952": {
      "score": 80,
      "advice": "Engage in activities that bring you joy and connect with loved ones.",
      "lucky_number": 3
    },
    "1964": {
      "score": 85,
      "advice": "Pursue new learning opportunities and share your wisdom with others.",
      "lucky_number": 9
    },
    "1976": {
      "score": 90,
      "advice": "Your ambition will be rewarded; take calculated risks in your career.",
      "lucky_number": 1
    },
    "1988": {
      "score": 88,
      "advice": "Build strong foundations in your personal and professional life.",
      "lucky_number": 6
    },
    "2000": {
      "score": 78,
      "advice": "Embrace flexibility and adapt to changes with an open mind.",
      "lucky_number": 4
    }
  },
  "2025-12-31": {
    "1940": {
      "score": 75,
      "advice": "Focus on maintaining a balanced lifestyle to navigate potential health fluctuations.",
      "lucky_number": 4
    },
    "1952": {
      "score": 80,
      "advice": "Invest wisely in your long-term financial security, avoiding impulsive spending.",
      "lucky_number": 9
    },
    "1964": {
      "score": 85,
      "advice": "Embrace new opportunities in your career with confidence and strategic planning.",
      "lucky_number": 3
    },
    "1976": {
      "score": 70,
      "advice": "Prioritize clear communication in relationships to resolve misunderstandings promptly.",
      "lucky_number": 6
    },
    "1988": {
      "score": 90,
      "advice": "Leverage your innovative ideas to achieve significant breakthroughs in your personal projects.",
      "lucky_number": 1
    },
    "2000": {
      "score": 78,
      "advice": "Seek mentorship to guide your early career development and expand your skill set.",
      "lucky_number": 5
    }
  }
}