{
  "2025-12-27": {
    "1943": {
      "score": 70,
      "advice": "Focus on maintaining good relationships and avoiding unnecessary conflicts this year.",
      "lucky_number": 5
    },
    "1955": {
      "score": 75,
      "advice": "Prioritize your health and well-being by incorporating regular exercise and a balanced diet.",
      "lucky_number": 2
    },
    "1967": {
      "score": 80,
      "advice": "Seek new opportunities for professional growth and learning to advance your career.",
      "lucky_number": 9
    },
    "1979": {
      "score": 85,
      "advice": "Invest wisely in your financial future and explore potential side hustlings to boost income.",
      "lucky_number": 1
    },
    "1991": {
      "score": 90,
      "advice": "Nurture your relationships and dedicate quality time to loved ones, strengthening your bonds.",
      "lucky_number": 3
    },
    "2003": {
      "score": 88,
      "advice": "Embrace challenges as opportunities for personal development and academic success.",
      "lucky_number": 6
    }
  },
  "2025-12-28": {
    "1943": {
      "score": 75,
      "advice": "Focus on nurturing your relationships and seeking solace in familiar comforts.",
      "lucky_number": 3
    },
    "1955": {
      "score": 80,
      "advice": "Embrace collaborative efforts at work and be open to receiving assistance.",
      "lucky_number": 9
    },
    "1967": {
      "score": 70,
      "advice": "Prioritize your well-being; consider gentle exercise and mindful reflection.",
      "lucky_number": 5
    },
    "1979": {
      "score": 90,
      "advice": "Your creativity will shine; channel your energy into artistic pursuits or innovative projects.",
      "lucky_number": 2
    },
    "1991": {
      "score": 85,
      "advice": "Seek new opportunities for personal growth and don't shy away from calculated risks.",
      "lucky_number": 8
    },
    "2003": {
      "score": 70,
      "advice": "Maintain a balanced approach to your studies or early career, avoiding overexertion.",
      "lucky_number": 4
    }
  },
  "2025-12-29": {
    "1943": {
      "score": 75,
      "advice": "Focus on conserving your energy and delegating tasks that are too demanding.",
      "lucky_number": 3
    },
    "1955": {
      "score": 80,
      "advice": "Seek opportunities for gentle social interaction and light intellectual stimulation.",
      "lucky_number": 9
    },
    "1967": {
      "score": 85,
      "advice": "Embrace collaborative projects where your experience can be valued and shared.",
      "lucky_number": 1
    },
    "1979": {
      "score": 90,
      "advice": "Invest time in refining your skills and seeking mentorship for career advancement.",
      "lucky_number": 5
    },
    "1991": {
      "score": 88,
      "advice": "Explore new avenues for personal growth, whether through education or creative pursuits.",
      "lucky_number": 2
    },
    "2003": {
      "score": 82,
      "advice": "Balance your desire for independence with the need for constructive feedback from others.",
      "lucky_number": 6
    }
  },
  "2025-12-30": {
    "1943": {
      "score": 70,
      "advice": "Focus on practical matters and avoid excessive optimism to navigate potential challenges.",
      "lucky_number": 5
    },
    "1955": {
      "score": 75,
      "advice": "Maintain a balanced approach to finances and relationships, seeking stability.",
      "lucky_number": 2
    },
    "1967": {
      "score": 80,
      "advice": "Embrace your natural leadership qualities to steer through opportunities effectively.",
      "lucky_number": 9
    },
    "1979": {
      "score": 85,
      "advice": "Be open to collaboration and new ideas; your adaptability will be key to success.",
      "lucky_number": 4
    },
    "1991": {
      "score": 90,
      "advice": "Invest in your personal growth and learning, as this will bring significant rewards.",
      "lucky_number": 1
    },
    "2003": {
      "score": 95,
      "advice": "Trust your intuition and be proactive in pursuing your goals; the path ahead is bright.",
      "lucky_number": 8
    }
  },
  "2025-12-31": {
    "1943": {
      "score": 78,
      "advice": "Focus on nurturing existing relationships as they will be a source of strength and joy.",
      "lucky_number": 3
    },
    "1955": {
      "score": 72,
      "advice": "Embrace small, consistent steps towards your goals for steady progress and satisfaction.",
      "lucky_number": 9
    },
    "1967": {
      "score": 88,
      "advice": "Prioritize your well-being by dedicating time to rest and activities that recharge your spirit.",
      "lucky_number": 1
    },
    "1979": {
      "score": 82,
      "advice": "Be open to unexpected opportunities, as they may lead to significant personal and professional growth.",
      "lucky_number": 5
    },
    "1991": {
      "score": 75,
      "advice": "Channel your creative energy into new projects, which could bring both fulfillment and recognition.",
      "lucky_number": 2
    },
    "2003": {
      "score": 90,
      "advice": "Maintain a balanced approach to your studies and social life, finding harmony in both areas.",
      "lucky_number": 6
    }
  }
}