{
  "2025-12-27": {
    "1942": {
      "score": 70,
      "advice": "Focus on nurturing existing relationships and avoid initiating new ventures this year.",
      "lucky_number": 3
    },
    "1954": {
      "score": 80,
      "advice": "Embrace flexibility and adapt to changes, as they will lead to unexpected opportunities.",
      "lucky_number": 5
    },
    "1966": {
      "score": 75,
      "advice": "Prioritize financial prudence and resist impulsive spending to maintain stability.",
      "lucky_number": 9
    },
    "1978": {
      "score": 85,
      "advice": "Your communication skills will be key to resolving conflicts and advancing your career.",
      "lucky_number": 1
    },
    "1990": {
      "score": 90,
      "advice": "This is a favorable year for personal growth and learning new skills; seize the moment.",
      "lucky_number": 6
    },
    "2002": {
      "score": 88,
      "advice": "Collaborate with others on projects, as teamwork will amplify your success.",
      "lucky_number": 4
    }
  },
  "2025-12-28": {
    "1942": {
      "score": 78,
      "advice": "Focus on nurturing relationships and finding contentment in simple routines.",
      "lucky_number": 3
    },
    "1954": {
      "score": 82,
      "advice": "Embrace collaboration and seek opportunities to share your wisdom with others.",
      "lucky_number": 9
    },
    "1966": {
      "score": 75,
      "advice": "Prioritize your well-being and delegate tasks to avoid burnout.",
      "lucky_number": 5
    },
    "1978": {
      "score": 88,
      "advice": "This year offers a chance for significant personal growth, so step outside your comfort zone.",
      "lucky_number": 1
    },
    "1990": {
      "score": 80,
      "advice": "Maintain a balanced approach to your career and personal life to ensure steady progress.",
      "lucky_number": 6
    },
    "2002": {
      "score": 70,
      "advice": "Be mindful of your expenses and practice patience in achieving your goals.",
      "lucky_number": 2
    }
  },
  "2025-12-29": {
    "1942": {
      "score": 70,
      "advice": "Focus on maintaining peace and harmony in your relationships, as misunderstandings can easily arise.",
      "lucky_number": 3
    },
    "1954": {
      "score": 65,
      "advice": "It's a good time to reflect on your health and make small, sustainable lifestyle changes.",
      "lucky_number": 9
    },
    "1966": {
      "score": 75,
      "advice": "Seek opportunities for collaboration at work, as teamwork will lead to greater success.",
      "lucky_number": 5
    },
    "1978": {
      "score": 80,
      "advice": "Embrace new learning experiences, as they will broaden your horizons and boost your career prospects.",
      "lucky_number": 1
    },
    "1990": {
      "score": 85,
      "advice": "Your social life will be vibrant; make an effort to connect with old friends and forge new bonds.",
      "lucky_number": 6
    },
    "2002": {
      "score": 78,
      "advice": "Stay focused on your studies or early career goals, and don't be afraid to ask for guidance.",
      "lucky_number": 2
    }
  },
  "2025-12-30": {
    "1942": {
      "score": 78,
      "advice": "Focus on maintaining your established routines and avoid unnecessary risks this year.",
      "lucky_number": 3
    },
    "1954": {
      "score": 82,
      "advice": "Embrace opportunities for social connection and share your wisdom with younger generations.",
      "lucky_number": 9
    },
    "1966": {
      "score": 88,
      "advice": "Seek balance between your professional ambitions and personal well-being to prevent burnout.",
      "lucky_number": 5
    },
    "1978": {
      "score": 75,
      "advice": "Be mindful of communication and ensure clarity in all your dealings to avoid misunderstandings.",
      "lucky_number": 1
    },
    "1990": {
      "score": 91,
      "advice": "Take bold steps towards your goals, but always have a contingency plan in place.",
      "lucky_number": 6
    },
    "2002": {
      "score": 85,
      "advice": "Explore new learning avenues and apply your fresh perspectives to challenges you encounter.",
      "lucky_number": 4
    }
  },
  "2025-12-31": {
    "1942": {
      "score": 70,
      "advice": "Focus on steady progress in finances; avoid impulsive spending to maintain stability.",
      "lucky_number": 3
    },
    "1954": {
      "score": 75,
      "advice": "Prioritize health by incorporating light exercise and a balanced diet into your daily routine.",
      "lucky_number": 8
    },
    "1966": {
      "score": 80,
      "advice": "Nurture your relationships by dedicating quality time to loved ones and open communication.",
      "lucky_number": 5
    },
    "1978": {
      "score": 85,
      "advice": "Embrace new opportunities in your career, but assess them thoroughly before committing.",
      "lucky_number": 1
    },
    "1990": {
      "score": 90,
      "advice": "Channel your energy into personal growth and learning new skills to enhance your future prospects.",
      "lucky_number": 9
    },
    "2002": {
      "score": 88,
      "advice": "Maintain focus on your studies or early career path, seeking guidance from mentors.",
      "lucky_number": 6
    }
  }
}