{
  "2025-12-27": {
    "1944": {
      "score": 78,
      "advice": "Focus on nurturing relationships this year, as they will provide unexpected support.",
      "lucky_number": 5
    },
    "1956": {
      "score": 88,
      "advice": "Embrace opportunities for learning and growth, as they will lead to significant personal advancement.",
      "lucky_number": 3
    },
    "1968": {
      "score": 72,
      "advice": "Be mindful of your financial decisions and avoid impulsive spending this year.",
      "lucky_number": 9
    },
    "1980": {
      "score": 92,
      "advice": "Your hard work and dedication will pay off handsomely, leading to career success and recognition.",
      "lucky_number": 1
    },
    "1992": {
      "score": 80,
      "advice": "Prioritize your well-being and seek balance between your professional and personal life.",
      "lucky_number": 6
    },
    "2004": {
      "score": 85,
      "advice": "Explore new creative avenues and don't be afraid to express your unique talents.",
      "lucky_number": 4
    }
  },
  "2025-12-28": {
    "1944": {
      "score": 70,
      "advice": "Focus on maintaining existing relationships and avoid new ventures that could be draining.",
      "lucky_number": 3
    },
    "1956": {
      "score": 80,
      "advice": "Prioritize your health and well-being by incorporating light exercise and mindful eating.",
      "lucky_number": 6
    },
    "1968": {
      "score": 75,
      "advice": "A balanced approach to work and personal life will prevent burnout and foster contentment.",
      "lucky_number": 9
    },
    "1980": {
      "score": 85,
      "advice": "Embrace collaboration in your professional life; teamwork will lead to unexpected successes.",
      "lucky_number": 2
    },
    "1992": {
      "score": 90,
      "advice": "Take calculated risks in your career and personal development; your innovative spirit will be rewarded.",
      "lucky_number": 5
    },
    "2004": {
      "score": 82,
      "advice": "Invest time in learning new skills, as this will significantly boost your confidence and future prospects.",
      "lucky_number": 8
    }
  },
  "2025-12-29": {
    "1944": {
      "score": 70,
      "advice": "Focus on maintaining a balanced routine to support your well-being.",
      "lucky_number": 3
    },
    "1956": {
      "score": 75,
      "advice": "Seek opportunities for gentle social engagement to foster connection.",
      "lucky_number": 8
    },
    "1968": {
      "score": 80,
      "advice": "Embrace new learning experiences, as they will bring unexpected benefits.",
      "lucky_number": 5
    },
    "1980": {
      "score": 85,
      "advice": "Channels your energy into creative pursuits that align with your passions.",
      "lucky_number": 1
    },
    "1992": {
      "score": 90,
      "advice": "Collaborate with others on projects, as teamwork will lead to success.",
      "lucky_number": 6
    },
    "2004": {
      "score": 88,
      "advice": "Stay curious and open to exploring different paths for personal growth.",
      "lucky_number": 9
    }
  },
  "2025-12-30": {
    "1944": {
      "score": 78,
      "advice": "Focus on maintaining your established routines for stability and well-being.",
      "lucky_number": 3
    },
    "1956": {
      "score": 82,
      "advice": "Engage in activities that bring you joy and connect with loved ones.",
      "lucky_number": 5
    },
    "1968": {
      "score": 75,
      "advice": "Be mindful of your expenditures to ensure financial security.",
      "lucky_number": 1
    },
    "1980": {
      "score": 88,
      "advice": "Embrace new opportunities with confidence, as they are likely to be fruitful.",
      "lucky_number": 9
    },
    "1992": {
      "score": 85,
      "advice": "Invest time in learning new skills to enhance your career prospects.",
      "lucky_number": 7
    },
    "2004": {
      "score": 90,
      "advice": "Collaborate effectively with peers to achieve ambitious goals.",
      "lucky_number": 4
    }
  },
  "2025-12-31": {
    "1944": {
      "score": 70,
      "advice": "Focus on maintaining your established routines and enjoying the fruits of your past labor, seeking peace and quiet.",
      "lucky_number": 3
    },
    "1956": {
      "score": 75,
      "advice": "Embrace social connections and shared activities, finding joy and support in your community.",
      "lucky_number": 9
    },
    "1968": {
      "score": 80,
      "advice": "Seek opportunities for intellectual growth and new learning experiences to keep your mind sharp and engaged.",
      "lucky_number": 5
    },
    "1980": {
      "score": 85,
      "advice": "Channel your sharp wit and adaptability into problem-solving, aiming for clear and decisive actions.",
      "lucky_number": 1
    },
    "1992": {
      "score": 90,
      "advice": "Embrace your natural charisma and inventiveness to navigate any challenges with confidence and creativity.",
      "lucky_number": 6
    },
    "2004": {
      "score": 88,
      "advice": "Utilize your quick thinking and resourcefulness to explore new ventures and make innovative progress.",
      "lucky_number": 2
    }
  }
}