{
  "2025-12-27": {
    "1949": {
      "score": 78,
      "advice": "Focus on steady progress and avoid unnecessary risks in your endeavors.",
      "lucky_number": 3
    },
    "1961": {
      "score": 82,
      "advice": "Your diligence will be rewarded, so continue to apply yourself with determination.",
      "lucky_number": 9
    },
    "1973": {
      "score": 75,
      "advice": "Seek balance between your professional life and personal well-being to avoid burnout.",
      "lucky_number": 5
    },
    "1985": {
      "score": 88,
      "advice": "Embrace new opportunities with confidence, as they hold significant potential for growth.",
      "lucky_number": 1
    },
    "1997": {
      "score": 72,
      "advice": "Practice patience and careful consideration before making important decisions.",
      "lucky_number": 6
    },
    "2009": {
      "score": 85,
      "advice": "Your sharp intellect will help you overcome challenges and achieve your goals effectively.",
      "lucky_number": 2
    }
  },
  "2025-12-28": {
    "1949": {
      "score": 75,
      "advice": "Focus on steady progress in your career, as new opportunities may arise with careful planning.",
      "lucky_number": 3
    },
    "1961": {
      "score": 80,
      "advice": "Nurture your relationships by being present and communicative, fostering deeper connections.",
      "lucky_number": 5
    },
    "1973": {
      "score": 70,
      "advice": "Prioritize your well-being; incorporate regular exercise and mindful practices into your routine.",
      "lucky_number": 8
    },
    "1985": {
      "score": 85,
      "advice": "Embrace adaptability in your financial ventures, as calculated risks could lead to significant rewards.",
      "lucky_number": 1
    },
    "1997": {
      "score": 78,
      "advice": "Seek knowledge and skill development to enhance your personal and professional growth.",
      "lucky_number": 4
    },
    "2009": {
      "score": 72,
      "advice": "Engage in creative pursuits and hobbies that bring you joy and relieve stress.",
      "lucky_number": 6
    }
  },
  "2025-12-29": {
    "1949": {
      "score": 75,
      "advice": "Focus on steady progress and avoid unnecessary risks in financial matters this year.",
      "lucky_number": 3
    },
    "1961": {
      "score": 80,
      "advice": "Nurture your relationships by actively listening and showing appreciation to loved ones.",
      "lucky_number": 8
    },
    "1973": {
      "score": 70,
      "advice": "Embrace new learning opportunities to stay adaptable and relevant in your career.",
      "lucky_number": 5
    },
    "1985": {
      "score": 85,
      "advice": "Your diligent efforts will be recognized, so continue to work with integrity and focus.",
      "lucky_number": 1
    },
    "1997": {
      "score": 78,
      "advice": "Prioritize your well-being by incorporating regular exercise and mindful practices into your routine.",
      "lucky_number": 6
    },
    "2009": {
      "score": 72,
      "advice": "Maintain your focus on studies and teamwork to achieve academic and social harmony.",
      "lucky_number": 4
    }
  },
  "2025-12-30": {
    "1949": {
      "score": 75,
      "advice": "Focus on steady progress and avoid impulsive decisions in your financial matters this year.",
      "lucky_number": 3
    },
    "1961": {
      "score": 80,
      "advice": "Nurture your relationships by being present and communicative with loved ones.",
      "lucky_number": 9
    },
    "1973": {
      "score": 70,
      "advice": "Prioritize your well-being by incorporating healthy habits into your daily routine.",
      "lucky_number": 5
    },
    "1985": {
      "score": 85,
      "advice": "Embrace new opportunities for career growth, but ensure you are well-prepared before taking a leap.",
      "lucky_number": 2
    },
    "1997": {
      "score": 90,
      "advice": "This is a favorable time for learning and personal development, so invest your energy in expanding your knowledge.",
      "lucky_number": 8
    },
    "2009": {
      "score": 88,
      "advice": "Maintain a balanced approach to your studies and social life to ensure overall success and happiness.",
      "lucky_number": 6
    }
  },
  "2025-12-31": {
    "1949": {
      "score": 75,
      "advice": "Focus on meticulous planning to navigate potential unexpected challenges.",
      "lucky_number": 3
    },
    "1961": {
      "score": 80,
      "advice": "Embrace collaboration and open communication for smoother progress.",
      "lucky_number": 9
    },
    "1973": {
      "score": 70,
      "advice": "Prioritize patience and avoid hasty decisions, especially in financial matters.",
      "lucky_number": 5
    },
    "1985": {
      "score": 85,
      "advice": "Leverage your inherent resilience to overcome obstacles and achieve your goals.",
      "lucky_number": 1
    },
    "1997": {
      "score": 78,
      "advice": "Seek wisdom from mentors and be open to new learning opportunities.",
      "lucky_number": 6
    },
    "2009": {
      "score": 72,
      "advice": "Maintain a balanced approach to studies and social activities to avoid burnout.",
      "lucky_number": 2
    }
  }
}