{
  "2025-12-27": {
    "1947": {
      "score": 75,
      "advice": "Focus on clear communication to avoid misunderstandings with loved ones.",
      "lucky_number": 3
    },
    "1959": {
      "score": 80,
      "advice": "Embrace new opportunities that align with your long-term financial goals.",
      "lucky_number": 5
    },
    "1971": {
      "score": 70,
      "advice": "Prioritize rest and self-care to maintain your energy levels throughout the week.",
      "lucky_number": 9
    },
    "1983": {
      "score": 85,
      "advice": "Collaborate with colleagues on projects to achieve greater success and recognition.",
      "lucky_number": 1
    },
    "1995": {
      "score": 78,
      "advice": "Be open to learning new skills that can enhance your career prospects.",
      "lucky_number": 6
    },
    "2007": {
      "score": 72,
      "advice": "Engage in activities that foster creativity and personal growth.",
      "lucky_number": 2
    }
  },
  "2025-12-28": {
    "1947": {
      "score": 75,
      "advice": "Focus on managing your energy wisely this year; avoid overextending yourself.",
      "lucky_number": 3
    },
    "1959": {
      "score": 80,
      "advice": "Embrace opportunities for connection and collaboration to foster growth.",
      "lucky_number": 9
    },
    "1971": {
      "score": 70,
      "advice": "Be mindful of your finances and avoid impulsive spending.",
      "lucky_number": 1
    },
    "1983": {
      "score": 85,
      "advice": "Pursue your ambitions with confidence, as this is a favorable time for career advancements.",
      "lucky_number": 5
    },
    "1995": {
      "score": 78,
      "advice": "Nurture your relationships by making time for loved ones and open communication.",
      "lucky_number": 2
    },
    "2007": {
      "score": 82,
      "advice": "Stay curious and embrace new learning experiences that will broaden your horizons.",
      "lucky_number": 6
    }
  },
  "2025-12-29": {
    "1947": {
      "score": 75,
      "advice": "Focus on steady progress and avoid impulsive decisions this year.",
      "lucky_number": 3
    },
    "1959": {
      "score": 88,
      "advice": "Embrace new opportunities with confidence and maintain a positive outlook.",
      "lucky_number": 9
    },
    "1971": {
      "score": 92,
      "advice": "Your strong work ethic will be rewarded, so continue to pursue your goals diligently.",
      "lucky_number": 1
    },
    "1983": {
      "score": 82,
      "advice": "Pay attention to details in your finances and nurture your relationships.",
      "lucky_number": 5
    },
    "1995": {
      "score": 78,
      "advice": "Seek balance between your personal and professional life to avoid burnout.",
      "lucky_number": 2
    },
    "2007": {
      "score": 85,
      "advice": "Explore your interests with curiosity and learn from every experience.",
      "lucky_number": 6
    }
  },
  "2025-12-30": {
    "1947": {
      "score": 75,
      "advice": "Focus on steady progress and avoid impulsive decisions, especially regarding finances.",
      "lucky_number": 3
    },
    "1959": {
      "score": 80,
      "advice": "Nurture your relationships and be open to collaborative efforts for mutual benefit.",
      "lucky_number": 9
    },
    "1971": {
      "score": 85,
      "advice": "Embrace new opportunities with confidence, as your hard work is likely to be rewarded.",
      "lucky_number": 1
    },
    "1983": {
      "score": 70,
      "advice": "Prioritize your well-being and seek balance between your professional and personal life.",
      "lucky_number": 6
    },
    "1995": {
      "score": 90,
      "advice": "Your creativity and innovative spirit will shine; don't hesitate to express your unique ideas.",
      "lucky_number": 5
    },
    "2007": {
      "score": 88,
      "advice": "Stay curious and continue learning; new knowledge will open doors to exciting possibilities.",
      "lucky_number": 2
    }
  },
  "2025-12-31": {
    "1947": {
      "score": 70,
      "advice": "Focus on nurturing your close relationships to find inner peace and support.",
      "lucky_number": 3
    },
    "1959": {
      "score": 80,
      "advice": "Embrace new opportunities with confidence, as your intuition will guide you wisely.",
      "lucky_number": 9
    },
    "1971": {
      "score": 75,
      "advice": "Prioritize your well-being by incorporating regular breaks and mindful practices into your routine.",
      "lucky_number": 5
    },
    "1983": {
      "score": 90,
      "advice": "Your ambition will be rewarded; continue to push forward with strategic planning and hard work.",
      "lucky_number": 1
    },
    "1995": {
      "score": 85,
      "advice": "Collaborate with others, as teamwork will amplify your strengths and lead to successful outcomes.",
      "lucky_number": 2
    },
    "2007": {
      "score": 78,
      "advice": "Explore your creative passions; they will bring joy and unexpected personal growth.",
      "lucky_number": 6
    }
  }
}