{
  "2025-12-27": {
    "1951": {
      "score": 75,
      "advice": "Focus on practical steps to improve your financial stability this year.",
      "lucky_number": 3
    },
    "1963": {
      "score": 80,
      "advice": "Nurture your existing relationships and avoid unnecessary conflicts.",
      "lucky_number": 9
    },
    "1975": {
      "score": 70,
      "advice": "Be mindful of your health; prioritize rest and balanced eating.",
      "lucky_number": 5
    },
    "1987": {
      "score": 85,
      "advice": "Embrace new opportunities in your career, but proceed with caution.",
      "lucky_number": 1
    },
    "1999": {
      "score": 90,
      "advice": "Your creativity is high; channel it into personal projects and learning.",
      "lucky_number": 6
    },
    "2011": {
      "score": 78,
      "advice": "Focus on your studies and developing good habits for the future.",
      "lucky_number": 2
    }
  },
  "2025-12-28": {
    "1951": {
      "score": 70,
      "advice": "Focus on consolidating existing resources rather than seeking new ventures this week.",
      "lucky_number": 3
    },
    "1963": {
      "score": 80,
      "advice": "Embrace opportunities for collaboration as they will yield significant benefits.",
      "lucky_number": 9
    },
    "1975": {
      "score": 75,
      "advice": "Pay attention to the details in financial matters to avoid unforeseen complications.",
      "lucky_number": 5
    },
    "1987": {
      "score": 85,
      "advice": "Your innovative ideas are well-received now, so present them with confidence.",
      "lucky_number": 1
    },
    "1999": {
      "score": 90,
      "advice": "This is a fortunate time to learn new skills that will enhance your personal growth.",
      "lucky_number": 6
    },
    "2011": {
      "score": 88,
      "advice": "Engage in creative activities to boost your energy and express yourself freely.",
      "lucky_number": 4
    }
  },
  "2025-12-29": {
    "1951": {
      "score": 70,
      "advice": "Focus on clear communication this week to avoid misunderstandings in relationships.",
      "lucky_number": 3
    },
    "1963": {
      "score": 65,
      "advice": "Be mindful of your spending; unexpected expenses may arise, so budget wisely.",
      "lucky_number": 8
    },
    "1975": {
      "score": 80,
      "advice": "Your creativity is high; channel this energy into a personal project or a new hobby.",
      "lucky_number": 5
    },
    "1987": {
      "score": 75,
      "advice": "Seek collaboration on work projects to leverage diverse perspectives and achieve better results.",
      "lucky_number": 2
    },
    "1999": {
      "score": 85,
      "advice": "Embrace new learning opportunities; knowledge gained now will prove beneficial in the future.",
      "lucky_number": 9
    },
    "2011": {
      "score": 70,
      "advice": "Spend quality time with family and friends, as emotional connections will be particularly rewarding.",
      "lucky_number": 1
    }
  },
  "2025-12-30": {
    "1951": {
      "score": 88,
      "advice": "Focus on nurturing relationships and sharing wisdom, as your experience is highly valued by those around you.",
      "lucky_number": 5
    },
    "1963": {
      "score": 92,
      "advice": "Embrace new learning opportunities, as your adaptable nature will allow you to master new skills and advance your goals.",
      "lucky_number": 3
    },
    "1975": {
      "score": 85,
      "advice": "Prioritize clear communication in all dealings, ensuring misunderstandings are avoided and collaboration thrives.",
      "lucky_number": 9
    },
    "1987": {
      "score": 90,
      "advice": "Channel your energy into creative projects; your innovative ideas will bring both personal satisfaction and potential recognition.",
      "lucky_number": 1
    },
    "1999": {
      "score": 87,
      "advice": "Seek balance between your personal aspirations and your responsibilities to ensure sustainable progress and well-being.",
      "lucky_number": 6
    },
    "2011": {
      "score": 91,
      "advice": "Embrace challenges with a positive attitude, as they will serve as stepping stones for significant personal growth and achievement.",
      "lucky_number": 2
    }
  },
  "2025-12-31": {
    "1951": {
      "score": 70,
      "advice": "Focus on clearing unfinished tasks before year-end to start fresh.",
      "lucky_number": 3
    },
    "1963": {
      "score": 80,
      "advice": "Embrace collaboration in your endeavors for better outcomes.",
      "lucky_number": 9
    },
    "1975": {
      "score": 75,
      "advice": "Pay attention to your health and well-being; schedule rest.",
      "lucky_number": 1
    },
    "1987": {
      "score": 85,
      "advice": "Your innovative ideas will be well-received, so express them confidently.",
      "lucky_number": 5
    },
    "1999": {
      "score": 90,
      "advice": "Financial opportunities may arise, so be prudent and discerning.",
      "lucky_number": 2
    },
    "2011": {
      "score": 78,
      "advice": "Maintain a positive attitude when facing academic or personal challenges.",
      "lucky_number": 6
    }
  }
}