{
  "2025-12-27": {
    "1948": {
      "score": 75,
      "advice": "Focus on maintaining strong relationships, as they will be a source of support and joy.",
      "lucky_number": 3
    },
    "1960": {
      "score": 88,
      "advice": "Embrace new opportunities for personal growth and learning; this is a time to expand your horizons.",
      "lucky_number": 9
    },
    "1972": {
      "score": 78,
      "advice": "Prioritize your health and well-being by incorporating regular exercise and mindful practices.",
      "lucky_number": 1
    },
    "1984": {
      "score": 92,
      "advice": "Your career prospects are bright; take calculated risks and pursue your ambitions with confidence.",
      "lucky_number": 6
    },
    "1996": {
      "score": 82,
      "advice": "Financial prudence is advised; carefully manage your resources and avoid impulsive spending.",
      "lucky_number": 4
    },
    "2008": {
      "score": 70,
      "advice": "Dedicate time to your studies and creative pursuits, as they will yield rewarding results.",
      "lucky_number": 8
    }
  },
  "2025-12-28": {
    "1948": {
      "score": 85,
      "advice": "Focus on consolidating your wisdom and sharing it with younger generations.",
      "lucky_number": 7
    },
    "1960": {
      "score": 78,
      "advice": "Maintain patience in financial matters and avoid impulsive decisions.",
      "lucky_number": 3
    },
    "1972": {
      "score": 92,
      "advice": "Embrace opportunities for professional growth and new collaborations.",
      "lucky_number": 5
    },
    "1984": {
      "score": 88,
      "advice": "Nurture your relationships with clear communication and thoughtful gestures.",
      "lucky_number": 9
    },
    "1996": {
      "score": 75,
      "advice": "Prioritize self-care and establish healthy routines to manage stress.",
      "lucky_number": 2
    },
    "2008": {
      "score": 82,
      "advice": "Channel your energy into learning new skills that will benefit your future.",
      "lucky_number": 6
    }
  },
  "2025-12-29": {
    "1948": {
      "score": 75,
      "advice": "Focus on maintaining harmony in your relationships by being patient and understanding, as this will bring you peace of mind.",
      "lucky_number": 3
    },
    "1960": {
      "score": 80,
      "advice": "Embrace new opportunities for growth, both personally and professionally, by stepping out of your comfort zone with confidence.",
      "lucky_number": 9
    },
    "1972": {
      "score": 70,
      "advice": "Prioritize your well-being by dedicating time to rest and rejuvenation, ensuring you have the energy to face challenges.",
      "lucky_number": 5
    },
    "1984": {
      "score": 85,
      "advice": "Invest your energy wisely in projects that align with your long-term goals, and don't be afraid to delegate tasks.",
      "lucky_number": 1
    },
    "1996": {
      "score": 78,
      "advice": "Seek knowledge and skills that will enhance your career path, as continuous learning will open doors to success.",
      "lucky_number": 8
    },
    "2008": {
      "score": 72,
      "advice": "Practice mindful communication to avoid misunderstandings, especially with friends and family, fostering stronger bonds.",
      "lucky_number": 6
    }
  },
  "2025-12-30": {
    "1948": {
      "score": 75,
      "advice": "Focus on conserving your energy and prioritizing rest to maintain your well-being.",
      "lucky_number": 3
    },
    "1960": {
      "score": 88,
      "advice": "Embrace new opportunities for learning and personal growth that will enrich your life.",
      "lucky_number": 5
    },
    "1972": {
      "score": 92,
      "advice": "Your communication skills will be sharp, use them to resolve any lingering conflicts effectively.",
      "lucky_number": 1
    },
    "1984": {
      "score": 80,
      "advice": "Consider investing wisely in your future, as financial prudence will pay off.",
      "lucky_number": 9
    },
    "1996": {
      "score": 78,
      "advice": "Nurture your relationships with loved ones; their support will be invaluable.",
      "lucky_number": 2
    },
    "2008": {
      "score": 85,
      "advice": "Approach your studies with diligence and curiosity; you will achieve excellent results.",
      "lucky_number": 6
    }
  },
  "2025-12-31": {
    "1948": {
      "score": 75,
      "advice": "Focus on strengthening existing relationships as new connections may prove to be draining.",
      "lucky_number": 3
    },
    "1960": {
      "score": 80,
      "advice": "Embrace opportunities for growth in your career, but remember to delegate tasks effectively.",
      "lucky_number": 9
    },
    "1972": {
      "score": 90,
      "advice": "Your financial intuition is strong, so trust your gut when making investment decisions.",
      "lucky_number": 1
    },
    "1984": {
      "score": 85,
      "advice": "Prioritize self-care and mental well-being to navigate potential stressors with grace.",
      "lucky_number": 5
    },
    "1996": {
      "score": 70,
      "advice": "Be open to learning new skills, as adaptability will be key to overcoming unexpected challenges.",
      "lucky_number": 6
    },
    "2008": {
      "score": 95,
      "advice": "This is a year of significant academic or personal achievement; celebrate your successes.",
      "lucky_number": 2
    }
  }
}