{
  "2025-12-27": {
    "1945": {
      "score": 75,
      "advice": "Focus on stable investments and enjoy the fruits of your labor.",
      "lucky_number": 3
    },
    "1957": {
      "score": 80,
      "advice": "Maintain clear communication with loved ones to strengthen bonds.",
      "lucky_number": 9
    },
    "1969": {
      "score": 70,
      "advice": "Prioritize self-care and avoid overextending yourself professionally.",
      "lucky_number": 5
    },
    "1981": {
      "score": 85,
      "advice": "Embrace new opportunities for career growth with confidence.",
      "lucky_number": 1
    },
    "1993": {
      "score": 78,
      "advice": "Be open to learning and adapt quickly to changing circumstances.",
      "lucky_number": 6
    },
    "2005": {
      "score": 82,
      "advice": "Channel your energy into academic pursuits and creative projects.",
      "lucky_number": 2
    }
  },
  "2025-12-28": {
    "1945": {
      "score": 75,
      "advice": "Focus on practical solutions and avoid getting lost in abstract theories this year.",
      "lucky_number": 3
    },
    "1957": {
      "score": 80,
      "advice": "Embrace clear communication to navigate potential misunderstandings with loved ones.",
      "lucky_number": 8
    },
    "1969": {
      "score": 70,
      "advice": "Prioritize steady progress over grand gestures to achieve your goals.",
      "lucky_number": 5
    },
    "1981": {
      "score": 90,
      "advice": "Your diligent efforts will pay off handsomely, so continue to work with determination.",
      "lucky_number": 1
    },
    "1993": {
      "score": 85,
      "advice": "Seek opportunities for learning and skill development to enhance your career prospects.",
      "lucky_number": 6
    },
    "2005": {
      "score": 78,
      "advice": "Balance your studies with social activities to ensure a well-rounded development.",
      "lucky_number": 4
    }
  },
  "2025-12-29": {
    "1945": {
      "score": 70,
      "advice": "Focus on financial prudence and avoid speculative ventures.",
      "lucky_number": 3
    },
    "1957": {
      "score": 65,
      "advice": "Prioritize your health and well-being; schedule regular check-ups.",
      "lucky_number": 9
    },
    "1969": {
      "score": 80,
      "advice": "Nurture existing relationships and be open to new connections.",
      "lucky_number": 5
    },
    "1981": {
      "score": 75,
      "advice": "Embrace professional challenges with confidence and strategic planning.",
      "lucky_number": 1
    },
    "1993": {
      "score": 85,
      "advice": "Seek knowledge and skill development to advance your career goals.",
      "lucky_number": 8
    },
    "2005": {
      "score": 70,
      "advice": "Balance your social life with your academic pursuits for a well-rounded experience.",
      "lucky_number": 4
    }
  },
  "2025-12-30": {
    "1945": {
      "score": 75,
      "advice": "Focus on clear communication to avoid misunderstandings in relationships.",
      "lucky_number": 3
    },
    "1957": {
      "score": 80,
      "advice": "Invest wisely in long-term opportunities that align with your goals.",
      "lucky_number": 9
    },
    "1969": {
      "score": 70,
      "advice": "Prioritize your health by incorporating regular exercise and mindful eating.",
      "lucky_number": 1
    },
    "1981": {
      "score": 85,
      "advice": "Embrace new challenges at work as they can lead to significant career advancement.",
      "lucky_number": 5
    },
    "1993": {
      "score": 78,
      "advice": "Nurture your creative side through hobbies; it will bring unexpected joy and relief.",
      "lucky_number": 2
    },
    "2005": {
      "score": 72,
      "advice": "Seek knowledge actively and engage in learning new skills to broaden your horizons.",
      "lucky_number": 8
    }
  },
  "2025-12-31": {
    "1945": {
      "score": 75,
      "advice": "Focus on maintaining existing relationships and avoid unnecessary risks in financial matters.",
      "lucky_number": 3
    },
    "1957": {
      "score": 80,
      "advice": "Embrace new learning opportunities that can enhance your career prospects.",
      "lucky_number": 9
    },
    "1969": {
      "score": 70,
      "advice": "Prioritize your health by incorporating regular exercise and mindful eating habits.",
      "lucky_number": 1
    },
    "1981": {
      "score": 85,
      "advice": "Seek collaborative solutions at work to overcome challenges and achieve shared goals.",
      "lucky_number": 5
    },
    "1993": {
      "score": 78,
      "advice": "Invest time in personal development and explore creative outlets for stress relief.",
      "lucky_number": 8
    },
    "2005": {
      "score": 82,
      "advice": "Balance your studies with social activities to foster a well-rounded experience.",
      "lucky_number": 6
    }
  }
}