{
  "2025-12-27": {
    "1941": {
      "score": 75,
      "advice": "Focus on nurturing your existing relationships and avoid unnecessary conflicts.",
      "lucky_number": 3
    },
    "1953": {
      "score": 80,
      "advice": "Embrace new opportunities for learning and personal growth that come your way.",
      "lucky_number": 6
    },
    "1965": {
      "score": 70,
      "advice": "Be mindful of your health and prioritize rest to maintain your energy levels.",
      "lucky_number": 9
    },
    "1977": {
      "score": 85,
      "advice": "Your financial prospects look promising, so consider making prudent investments.",
      "lucky_number": 2
    },
    "1989": {
      "score": 78,
      "advice": "Communication will be key in your career; express your ideas clearly and confidently.",
      "lucky_number": 5
    },
    "2001": {
      "score": 82,
      "advice": "Explore your creative side and don't be afraid to experiment with new hobbies.",
      "lucky_number": 8
    }
  },
  "2025-12-28": {
    "1941": {
      "score": 70,
      "advice": "Focus on maintaining harmony in relationships to avoid unnecessary stress.",
      "lucky_number": 3
    },
    "1953": {
      "score": 75,
      "advice": "Embrace new opportunities for personal growth, even if they seem daunting at first.",
      "lucky_number": 9
    },
    "1965": {
      "score": 80,
      "advice": "Financial prudence is key; avoid impulsive spending and focus on long-term stability.",
      "lucky_number": 5
    },
    "1977": {
      "score": 85,
      "advice": "Your dedication to your career will bring significant rewards, so keep up the hard work.",
      "lucky_number": 1
    },
    "1989": {
      "score": 90,
      "advice": "Nurture your creative side and explore new hobbies that bring you joy and fulfillment.",
      "lucky_number": 6
    },
    "2001": {
      "score": 82,
      "advice": "Prioritize your well-being by ensuring you get enough rest and practice self-care.",
      "lucky_number": 4
    }
  },
  "2025-12-29": {
    "1941": {
      "score": 70,
      "advice": "Focus on maintaining calm and clear communication to navigate potential misunderstandings.",
      "lucky_number": 5
    },
    "1953": {
      "score": 75,
      "advice": "Prioritize your well-being; gentle exercise and mindful moments will serve you well.",
      "lucky_number": 2
    },
    "1965": {
      "score": 80,
      "advice": "Opportunities for growth may arise through collaboration, so be open to teamwork.",
      "lucky_number": 9
    },
    "1977": {
      "score": 85,
      "advice": "Your sharp intellect will be your greatest asset; trust your intuition in decision-making.",
      "lucky_number": 4
    },
    "1989": {
      "score": 90,
      "advice": "Embrace new ventures with confidence; your adaptability will lead to favorable outcomes.",
      "lucky_number": 1
    },
    "2001": {
      "score": 82,
      "advice": "Invest time in learning and skill development to enhance your future prospects.",
      "lucky_number": 6
    }
  },
  "2025-12-30": {
    "1941": {
      "score": 75,
      "advice": "Focus on maintaining good health and cherish moments with loved ones.",
      "lucky_number": 3
    },
    "1953": {
      "score": 80,
      "advice": "Opportunities for financial growth may arise; invest wisely and avoid impulsive spending.",
      "lucky_number": 9
    },
    "1965": {
      "score": 70,
      "advice": "Nurture your relationships by communicating openly and honestly with your partner and family.",
      "lucky_number": 5
    },
    "1977": {
      "score": 85,
      "advice": "Embrace new challenges at work; your diligence and sharp intellect will be recognized.",
      "lucky_number": 1
    },
    "1989": {
      "score": 90,
      "advice": "This is a favorable year for personal development; pursue education or new skills to enhance your career prospects.",
      "lucky_number": 6
    },
    "2001": {
      "score": 78,
      "advice": "Be mindful of your finances and create a budget to ensure stability and achieve your short-term goals.",
      "lucky_number": 2
    }
  },
  "2025-12-31": {
    "1941": {
      "score": 80,
      "advice": "Focus on steady progress and nurturing existing relationships for a stable end to the year.",
      "lucky_number": 3
    },
    "1953": {
      "score": 75,
      "advice": "Be mindful of your energy levels; prioritize rest and gentle social interactions.",
      "lucky_number": 6
    },
    "1965": {
      "score": 90,
      "advice": "Embrace new opportunities with confidence, as your intuition will guide you well.",
      "lucky_number": 9
    },
    "1977": {
      "score": 85,
      "advice": "Invest your time wisely in projects that have long-term potential and personal fulfillment.",
      "lucky_number": 2
    },
    "1989": {
      "score": 70,
      "advice": "Communicate clearly and openly to avoid misunderstandings in both personal and professional spheres.",
      "lucky_number": 5
    },
    "2001": {
      "score": 95,
      "advice": "This is a favorable time for learning and expanding your horizons; embrace new knowledge.",
      "lucky_number": 1
    }
  }
}