{
  "2025-12-27": {
    "1950": {
      "score": 78,
      "advice": "Focus on building strong foundations in your financial planning for long-term security.",
      "lucky_number": 3
    },
    "1962": {
      "score": 82,
      "advice": "Embrace collaborative efforts at work, as teamwork will lead to significant achievements.",
      "lucky_number": 9
    },
    "1974": {
      "score": 75,
      "advice": "Prioritize your well-being by incorporating regular breaks and stress-reducing activities into your routine.",
      "lucky_number": 5
    },
    "1986": {
      "score": 88,
      "advice": "Seek out new learning opportunities, as they will unlock unexpected career advancements.",
      "lucky_number": 1
    },
    "1998": {
      "score": 80,
      "advice": "Be open to exploring different social circles, as new friendships can bring valuable perspectives.",
      "lucky_number": 6
    },
    "2010": {
      "score": 77,
      "advice": "Engage actively in your studies and seek guidance from teachers when facing challenges.",
      "lucky_number": 4
    }
  },
  "2025-12-28": {
    "1950": {
      "score": 70,
      "advice": "Focus on clear communication to avoid misunderstandings in your relationships this year.",
      "lucky_number": 3
    },
    "1962": {
      "score": 75,
      "advice": "Embrace new learning opportunities to enhance your skills and professional growth.",
      "lucky_number": 8
    },
    "1974": {
      "score": 80,
      "advice": "Invest wisely in your financial future, but proceed with caution and thorough research.",
      "lucky_number": 1
    },
    "1986": {
      "score": 85,
      "advice": "Nurture your existing relationships with sincerity and thoughtful gestures.",
      "lucky_number": 5
    },
    "1998": {
      "score": 90,
      "advice": "Seize opportunities for personal development and explore your creative passions.",
      "lucky_number": 9
    },
    "2010": {
      "score": 88,
      "advice": "Stay focused on your studies and maintain a balanced approach to your activities.",
      "lucky_number": 2
    }
  },
  "2025-12-29": {
    "1950": {
      "score": 75,
      "advice": "Focus on maintaining stable relationships by practicing open communication and empathy.",
      "lucky_number": 5
    },
    "1962": {
      "score": 80,
      "advice": "Invest time in learning new skills or exploring creative outlets to find personal fulfillment.",
      "lucky_number": 9
    },
    "1974": {
      "score": 90,
      "advice": "Embrace opportunities for career advancement by showcasing your leadership and innovative ideas.",
      "lucky_number": 3
    },
    "1986": {
      "score": 85,
      "advice": "Prioritize your financial well-being by budgeting wisely and seeking sound investment advice.",
      "lucky_number": 6
    },
    "1998": {
      "score": 70,
      "advice": "Be mindful of your energy levels; ensure adequate rest and stress management for overall health.",
      "lucky_number": 1
    },
    "2010": {
      "score": 95,
      "advice": "Continue to nurture your curiosity and embrace challenges in your academic pursuits.",
      "lucky_number": 8
    }
  },
  "2025-12-30": {
    "1950": {
      "score": 78,
      "advice": "Focus on nurturing existing relationships for support and shared success.",
      "lucky_number": 3
    },
    "1962": {
      "score": 88,
      "advice": "Embrace new opportunities with confidence, as they align with your ambitious spirit.",
      "lucky_number": 9
    },
    "1974": {
      "score": 72,
      "advice": "Prioritize your health and well-being by establishing a balanced routine.",
      "lucky_number": 5
    },
    "1986": {
      "score": 92,
      "advice": "Your innovative ideas will lead to significant career advancements and recognition.",
      "lucky_number": 1
    },
    "1998": {
      "score": 85,
      "advice": "Engage in collaborative projects; teamwork will amplify your personal achievements.",
      "lucky_number": 6
    },
    "2010": {
      "score": 75,
      "advice": "Maintain focus on your studies and creative pursuits to unlock your full potential.",
      "lucky_number": 2
    }
  },
  "2025-12-31": {
    "1950": {
      "score": 75,
      "advice": "Focus on consolidating your resources and planning for the future with a grounded approach.",
      "lucky_number": 3
    },
    "1962": {
      "score": 80,
      "advice": "Leverage your experience to guide others, finding fulfillment in mentorship and shared success.",
      "lucky_number": 5
    },
    "1974": {
      "score": 70,
      "advice": "Be mindful of communication pitfalls and strive for clarity in all your interactions to avoid misunderstandings.",
      "lucky_number": 1
    },
    "1986": {
      "score": 85,
      "advice": "Embrace new opportunities with courage, as your ambition will likely lead to significant professional advancements.",
      "lucky_number": 9
    },
    "1998": {
      "score": 90,
      "advice": "Your innovative ideas and energetic approach will attract positive attention and open doors to exciting collaborations.",
      "lucky_number": 6
    },
    "2010": {
      "score": 88,
      "advice": "Nurture your friendships and collaborative efforts, as teamwork will bring you immense joy and learning experiences.",
      "lucky_number": 4
    }
  }
}